%% 层次分析法
% 运用层次分析法构造系统模型时，大体可以分为以下四个步骤：
% （1）建立层次结构模型（目标层-->准则层-->方案层）
% （2）构造判断（成对比较）矩阵
% （3）层次单排序及其一致性检验
% （4）层次总排序及其一致性检验
disp('请输入准则层判断矩阵A(n阶)');
A = input('A=');
[n, n] = size(A);  % 得到矩阵的阶数，与后期RI有关
[V, D] = eig(A);  % 求得特征向量和特征值，V是整个矩阵的特征向量，D是矩阵的特征值，按照对角线元素排列的
% 求出最大特征值和它所对应的特征向量
tempNum = D(1, 1); 
pos = 1;
for h = 1:n
    if D(h, h) > tempNum
        tempNum = D(h, h);
        pos = h;
    end
end
w = abs(V(:, pos));
w = w/sum(w);
t = D(pos, pos);
disp('准则层特征向量w=');
disp(w);
disp('准则层最大特征根t=');
disp(t);
% 一致性检验
CI = (t-n)/(n-1);
RI = [0 0 0.52 0.89 1.12 1.26 1.36 1.41 1.52 1.54 1.56 1.58 1.60 1.61 1.615 1.62 1.63];
CR = CI/RI(n);
if CR < 0.10
    disp('此矩阵的一致性可以接受');
    disp('CI=');
    disp(CI);
    disp('CR=');
    disp(CR);
else
    disp('此矩阵的一致性验证失败，请重新进行评分');
end

